{
	"e stack remove": "Illegal Argument: count must be positive integer, but is ",
	"e stack add": "Illegal Argument: argument to Stack.add() must be array or 'Card'",

	"jack": "Jack",
	"king": "King",
	"queen": "Queen",
	"ace": "Ace",
	"jack-short": "J",
	"king-short": "K",
	"queen-short": "Q",
	"ace-short": "A",

	"tease": "<i>You should know that, right?</i>",
	"explanation": "Ok, apparently you don't. Let me explain...<br>The game is played with a standard 52-card deck; the card's values go from ace to 2 through 10, Jack, Queen, King. The card's colors are Diamonds and Hearts (red), as well as Clubs and Crosses (black). Your goal is to stack all cards of one color in rising sequence on the four card stacks at the top.<br>You have seven 'working stacks', whose number of cards are increasing to the right. Also, all other cards are stacked on a draw stack which is located at the top left. You can turn around top cards on the working stacks, and draw cards from the draw stack onto the open stack next to it.<br>You can pick cards from the working stacks and the open stack by clicking and dragging them (sometimes this requires a bit of effort, stubborn cards :-)). You can release cards onto the working stacks, but this follows some simple rules:<ul><li>Cards on top of each other must have different colors; and here by colors I mean black or red, as mentioned above.</li><li>A card on top of another card must be one card value below that other card.</li><li>Empty working stacks can only be occupied by Kings.</li></ul>If you have several open cards on top of another that follow these rules, you can move them together.<br>If the draw stack runs out, click on it again to turn the open stack over and use it again.<br>It is not uncommon that you cannot complete a game of Solitaire. As these games are completely random, even good or even perfect play gives you not much more than a 43% chance to win.<br>Anyways, good luck!",
	"by": "By",
	"game-name": "Solitaire",
	"win": "<strong>You won! (applause)</strong> Reload the page to play again."
}
